In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
a = [2, 5, 7, 8, 3]

In [5]:
b = pd.Series(a)

In [6]:
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [8]:
b = pd.Series(a, index= [0,1,2,3,4])
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [10]:
b =  pd.Series(a, index = ['a','b','c','d','e'])
b

a    2
b    5
c    7
d    8
e    3
dtype: int64

In [11]:
from datetime import date

In [13]:
ind = [date(y,m,d) for y,m,d in [(2018, 1, 17), (2018, 1, 15), (2018, 1, 19), (2018, 1 ,21), (2018, 1, 30)]]

In [14]:
ind

[datetime.date(2018, 1, 17),
 datetime.date(2018, 1, 15),
 datetime.date(2018, 1, 19),
 datetime.date(2018, 1, 21),
 datetime.date(2018, 1, 30)]

In [17]:
b = pd.Series(ind)
b

0    2018-01-17
1    2018-01-15
2    2018-01-19
3    2018-01-21
4    2018-01-30
dtype: object

In [18]:
b.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
b = pd.Series(a, dtype = np.float64)
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [27]:
b.index[3]

3

In [28]:
b.values

array([2., 5., 7., 8., 3.])

In [29]:
b = b.append(pd.Series({6:10, 7:15, 8:11, 9:14}))
b

0     2.0
1     5.0
2     7.0
3     8.0
4     3.0
6    10.0
7    15.0
8    11.0
9    14.0
dtype: float64

In [30]:
b = b.drop([0,1,2])

In [31]:
b

3     8.0
4     3.0
6    10.0
7    15.0
8    11.0
9    14.0
dtype: float64



создание DataFrame

In [32]:
df = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'],
                  'Col2': [1,2,3,4,5,6,7,8]}, columns=["Col1", 'Col2'])

In [33]:
df

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5
5    f     6
6    g     7
7    h     8

In [34]:
df.shape

(8, 2)

In [35]:
df.sample(5)

  Col1  Col2
6    g     7
1    b     2
7    h     8
3    d     4
0    a     1

In [36]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Col1    8 non-null object
Col2    8 non-null int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [40]:
df.describe()

          Col2
count  8.00000
mean   4.50000
std    2.44949
min    1.00000
25%    2.75000
50%    4.50000
75%    6.25000
max    8.00000

In [41]:
df.head()

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5

In [42]:
df['Col1'].head

<bound method NDFrame.head of 0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
Name: Col1, dtype: object>

In [43]:
df.Col1.head

<bound method NDFrame.head of 0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
Name: Col1, dtype: object>

In [44]:
df.tail

<bound method NDFrame.tail of   Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5
5    f     6
6    g     7
7    h     8>

In [45]:
df.loc[2, 'Col1']

'c'

In [46]:
df.loc[2,:]

Col1    c
Col2    3
Name: 2, dtype: object

In [47]:
df.loc[2:4, :]

  Col1  Col2
2    c     3
3    d     4
4    e     5

In [48]:
df.iloc[0,:]

Col1    a
Col2    1
Name: 0, dtype: object

In [50]:
df.iloc[0:2, 0]

0    a
1    b
Name: Col1, dtype: object

In [52]:
df.loc[df['Col2'].between(2,3), :]

  Col1  Col2
1    b     2
2    c     3

In [54]:
df.loc[df['Col1'].isin(['a','b']), :]

  Col1  Col2
0    a     1
1    b     2

In [55]:
df.loc[~df['Col1'].isin(['a','b']), :]

  Col1  Col2
2    c     3
3    d     4
4    e     5
5    f     6
6    g     7
7    h     8

In [56]:
df

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5
5    f     6
6    g     7
7    h     8

In [58]:
df.query('Col1 == "b"')

  Col1  Col2
1    b     2

In [60]:
df.query('Col2 > 5')

  Col1  Col2
5    f     6
6    g     7
7    h     8

In [61]:
df_copy =df.copy()

In [62]:
df_copy

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5
5    f     6
6    g     7
7    h     8

In [63]:
df.sample(frac = 0.5)

  Col1  Col2
4    e     5
3    d     4
0    a     1
7    h     8

In [64]:
df.sample(frac = 0.5, replace = True)

  Col1  Col2
4    e     5
0    a     1
4    e     5
4    e     5

In [65]:
df1 = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'],
                  'Col2': [1,2,3,4,5,6,7,8]}, columns=["Col1", 'Col2'])

In [66]:
df2 = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'],
                  'Col2': [1,2,3,4,5,6,7,8]}, columns=["Col1", 'Col2'])

In [ ]:
df  = pd.merge(df1, df2, on =)